---
type: ParameterSetIterator
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# ParameterSetIterator

`Autodesk.Revit.DB.ParameterSetIterator` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ParameterSetIterator | — | `public ParameterSetIterator ()` |
| Method | MoveNext | — | `public virtual bool MoveNext ()` |
| Method | Reset | — | `public virtual void Reset ()` |
| Property | Current | — | `public virtual Object Current { get ; }` |